import React from "react";
import styles from "./arabic.module.css";

const ArabicRules = () => {
  return (
    <section>
      <div className="rt-container">
        <div className="col-rt-12">
          <div className={`${styles.tabs}`}>
            <input type="radio" id="tab1" name="tab-control" defaultChecked />
            <input type="radio" id="tab2" name="tab-control" />
            <input type="radio" id="tab3" name="tab-control" />
            <input type="radio" id="tab4" name="tab-control" />
            <input type="radio" id="tab5" name="tab-control" />

            <ul className={styles.titles} dir="rtl">
              <li title="الكلمات و المصطلحات">
                <label htmlFor="tab1" role="button">
                  <span>الكلمات و المصطلحات</span>
                </label>
              </li>
              <li title="قوانين السيرفر">
                <label htmlFor="tab2" role="button">
                  <span>قوانين السيرفر</span>
                </label>
              </li>
              <li title="القوانين داخل المدينة">
                <label htmlFor="tab3" role="button">
                  <span>القوانين داخل المدينة</span>
                </label>
              </li>
              <li title="قوانين حسب الحالة">
                <label htmlFor="tab4" role="button">
                  <span>قوانين حسب الحالة</span>
                </label>
              </li>
              <li title="قوانين الستريمرز">
                <label htmlFor="tab5" role="button">
                  <span>قوانين الستريمرز</span>
                </label>
              </li>
            </ul>

            <div className={styles.slider}>
              <div className={styles.indicator}></div>
            </div>
            <center>
              <h3 style={{ color: "#ff0000", direction: "rtl" }}>
                طاقم سيرفر Dz-Crew للحياة الواقعية يحتفظ بالحق الكامل لتغيير هذه
                القوانين بدون سابق إنذار في أي وقت, لا يعطي هذا الحق لأي فرد من
                الطاقم بالمحاكمة بغير هذه القوانين
              </h3>
            </center>
            <div className={styles.content}>
              <section>
                <h2>الكلمات و المصطلحات</h2>
                <p>
                  سيوضح هذا القسم بعض الكلمات والمصطلحات التي قد تصادفك أثناء
                  المشاركة في اللعب. يُرجى التأكد من فهمك لهذه الشروط حيث لا
                  يُسمح بأي مما يلي في Dz-Crew RP.
                </p>
                <ul className={styles.rules}>
                  <h2>كلمات</h2>
                  <li><strong>Lags/لاج: </strong>صداع</li>
                  <li><strong>Microphone/ميكروفون: </strong>الأحبال الصوتية / الحنجرة</li>
                  <li><strong>Discord/الديسكورد: </strong>راديو</li>
                  <li><strong>Disconnect/نقفل: </strong>افصل مخي</li>
                  <li><strong>Ban/بان: </strong>رحلة</li>
                  <li><strong>Glitch/جليتش: </strong>سحر أسود</li>
                  <li><strong>Button/زر: </strong>عظلة</li>
                  <li><strong>Server/السيرفر: </strong>المدينة</li>
                  <li><strong>Chat: </strong>الجريدة الرسمية</li>
                  <li><strong>Server restart: </strong>إعصار</li>
                  <li><strong>الآي دي: </strong>CCP</li>
                  <h2>مصطلحات</h2>
                  <li>
                    <p>
                      <strong>Powergaming: </strong>يحظر على شخصيتك فعل أي شيء
                      لا يستطيع الإنسان فعله في الحياة الواقعية. إن تمثيل
                      الأدوار الذي لا يمنح اللاعبين الآخرين الفرصة للتصرف بحرية
                      بشأن أفعالهم مخالف للقانون
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>FailRP: </strong>مصطلح واسع ولكنه يحدث بشكل عام
                      عندما يفعل اللاعب شيئًا لا يعتبره معظم اللاعبين حقيقي.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Meta Gaming: </strong>يجب أن تفرق بينك وبين
                      الشخصية التي تلعبها في اللعبة ، يمنع استخدام أي معلومات لم
                      تحصل عليها شخصيتك من لعب الأدوار، مما قد يتسبب في تغيير
                      نتائج سيناريوهات لعب الأدوار الحالية أو المستقبلية.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Stream Sniping: </strong>التواجد في ستريم أثناء
                      وجودك على السيرفر يستخدم كدليل ضدك إذا تم تقديم شكوى.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Mass Roleplay: </strong>يتجاوز عدد سكان مدينة
                      دزكرو 7 ملايين نسمة ، وبالتالي هناك عدد كبير من المواطنين
                      من حولك ، خاصة في الأماكن العامة سواء كانوا على الأقدام أو
                      مسافرين ، لذلك لا تعتقد أنك وحدك ولا أحد يراقبك.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>FearRP: </strong> يجب أن تظهر الخوف عندما تكون
                      شخصيتك في خطر.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Value of Life: </strong>يجب أن تقدر حياتك وحريتك ،
                      وكذلك حياة الآخرين ، على سبيل المثال، لا يُسمح لك بإخراج
                      بندقيتك مع شخص يوجه بنادقه إليك. إذا كانت حياة شخصيتك في
                      خطر مباشر، فيجب أن تخشى وتطيع الأوامر المعطاة لك
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Random Death Matching: </strong>يحظر قتل أو خطف أو
                      حتى سجن الأشخاص دون سبب قاهر أو أن يسبقه نزاع لفظي.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Vehicle Death Matching: </strong>يحظر استخدام
                      المركبات لقتل اللاعبين.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Combat Logout: </strong>ممنوع الخروج من اللعبة
                      أثناء وجودك في صراع أو إذا لم ينته السيناريو الذي تشارك
                      فيه
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>No Scripts stories: </strong> لا يُسمح للاعبين
                      برواية الأحداث وفرضها لأن محاولة التحكم في السيناريو
                      تتعارض مع قواعد السيرفر، والهدف من لعب الأدوار هو المشاركة
                      في سيناريوهات تعاونية بين الأشخاص ، دون فرض أي نتيجة على
                      اللاعبين. أو خاصة الضحايا.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>New Life rules: </strong>عندما تخلق من جديد ، يجب
                      أن تنسى الأحداث التي أدت إلى موتك.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Vehicle Drive-bys: </strong>لا يُسمح بإطلاق النار
                      من مركبة إلا في حالة وجود سبب مقنع، لا يُسمح للسائق بإطلاق
                      النار ، ويُسمح فقط لشخص واحد (1) بإطلاق النار.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Lootboxing: </strong> يحظر نهب أي لاعب دون سبب
                      واضح . يحظر نهب لاعب تجده على الأرض بسبب حادث سيارة. يحظر
                      النهب إذا لم تشارك أنت أو مجموعتك في السيناريو. يحظر النهب
                      المتكرر بغرض سرقة الممتلكات
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Role-playing before the bloodshed: </strong>
                      يجب أن يبدأ كل نزاع لفظيًا أو مسبوقًا بأحداث أو قصة متعلقة
                      بذلك الهجوم ، ويجب أن يكون الضحية في هذا النزاع قادرًا على
                      فهم أن حياته في خطر ، ولأي سبب ، ومن يهاجمه ، قبل أن
                      يتضرر.
                    </p>
                  </li>

                  <li>
                    <p>
                      <strong>Non-Roleplay: </strong>تعتبر الإجراءات غير
                      الواقعية أو التي تروّج لأداء أدوار رديء الجودة بمثابة
                      أسلوب غير لعب الأدوار. يتعين على اللاعبين لعب دور الشخصية
                      في جميع الأوقات. يمكن للمشرفين إيقاف لعب الأدوار مؤقتًا أو
                      إلغاؤه فقط. يجب على اللاعبين عدم الدخول في مواقف التي ليس
                      لديهم وقت للعبها. إذا تمت مطاردة أحد اللاعبين ، فيجب عليه
                      الانتظار لمدة 15 دقيقة قبل أن يتمكن من تسجيل الخروج من
                      اللعبة..
                    </p>
                  </li>
                </ul>
              </section>
              <section>
                <h2>قوانين السيرفر</h2>
                <p>
                  من أجل دخول سيرفر ديزاد كرو للحياة الواقعية يجب ان تتوفر في
                  اللاعب الشروط التالية. هذه الشروط نهائية و لا توضع إي
                  إستثناءات من أجل اي احد. يوجد بعض اللاعبين القدم الذين تواجدوا
                  في السيرفر قبل هذه الشروط
                </p>
                <h3>شروط الإنظمام إلى السيرفر</h3>
                <ol className={styles.rules}>
                  <li>السن الادنى للانضمام للسيرفر هو 18 سنة .</li>
                  <li>يجب ان تكون متقن للغة العربية و تفهمها جيدا.</li>
                  <li>يجب ان تملك ميكروفون عالي الجودة للتواصل مع اللاعبين.</li>
                  <li>
                    ممنوع عليك اهانة اللاعبين باي شكل كان , لا تأخذ الروبلاي
                    بشكل شخصي.
                  </li>
                  <li>ممنوع التحدث في الدين و السياسة .</li>
                  <li>
                    يجب عليك اختيار اسم واقعي ( اسم و لقب ) لشخصيتك في الروبلاي
                    , ممنوع استعمال الارقام في كتابة الاسم.
                  </li>
                  <li>
                    لا يمكنك استعمال الاموال الحقيقة لشراء اغراض داخل اللعبة (
                    مثل سيارة او منزل) لدينا نظام اقتصادي جيد و لا نشجع الدفع
                    مقابل الفوز في اللعبة.
                  </li>
                  <li>
                    اي شيء يحدث لك اثناء تواجدك بعيدا عن الحاسوب اثناء اللعب
                    'AFK' هو تحت مسؤوليتك الخاصة , اذا وجدت شخص في هذه الحالة
                    'AFK' حاول الابتعاد عنه.
                  </li>
                  <li>
                    تعامل مع طاقم الدعم باحترام , فهم موجودون لضمان ان تكون
                    تجربتك في السيرفر جيدة , ممتعة و عادلة , قرارهم نهائي.
                  </li>
                  <li>
                    يجب ان تقدر حياتك دائما عند قيادة السيارة , هذا يعني انه لا
                    يجب عليك القيادة بسرعة جنونية في المدينة لانه يعرض حياتك
                    للخطر دون وجود سبب وجيه.
                  </li>
                  <li>
                    لا يمكنك ايقاف السيناريو مهما حدث , اذا كان هناك تجاوز
                    للقوانين يجب عليك اكمال السيناريو ثم التقدم للادارة و تقديم
                    شكوى.
                  </li>
                </ol>
              </section>
              <section>
                <h2>القوانين داخل المدينة</h2>
                <p>
                  القوانين داخل المدينة تعمل على حماية اللاعبين من الأخطاء و
                  إعطاء مستوى غالي من الرول بلاي.
                </p>
                <h3>
                  <strong>يجب على اللاعبين عدم:</strong>
                </h3>
                <ol>
                  <li>تجاهل لعب الأدوار.</li>
                  <li>
                    لقيادة فوق الجبال أو التلال شديدة الانحدار باستخدام مركبات
                    لا تسير على الطرق الوعرة
                  </li>
                  <li>
                    استدراج ومضايقة الشرطة ، التاكسي ، الميكانيكي ، الحماية
                    المدنية...
                  </li>
                  <li>المطالبة بأن تُقتل أو تجبر نفسك على الموت.</li>
                  <li>القفز غير الواقعي للسيارة.</li>
                  <li>إساءة استخدام المركبات باهظة الثمن.</li>
                  <li>استخدام مركبات العمل لأغراض أخرى.</li>
                  <li>إغمار أي مركبة في الماء عمدا.</li>
                  <li>
                    السباحة لفترة غير واقعية في المطاردة (أكثر من 5 دقائق).
                  </li>
                </ol>

                <h3>
                  <strong>المناطق الآمنة:</strong>
                </h3>
                <p>
                  داخل هده المناطق أو بالقرب منها ، لا يجوز للاعبين ارتكاب أي
                  جريمة أو عصيان أوامر إنفاذ القانون ولكن يُسمح لهم بالفرار أو
                  الكذب أو الاحتيال. إذا كان اللاعب يستخدم هده المناطق للحماية ،
                  فيجب على المهاجم انتظار مغادرة ذلك اللاعب للمنطقة. لا يجوز
                  للاعبين الذهاب إلى هده المناطق في غضون 15 دقيقة بعد الانخراط
                  في نشاط إجرامي أو مطاردة ناتجة ، ما لم يسلموا أنفسهم إلى
                  الشرطة.
                </p>
                <strong>الأماكن الآمنة:</strong>
                <ul>
                  <li>مقرالحكومة ومراكزالشرطة.</li>
                  <li>المستشفيات والمطارات والموانئ وأماكن العمل</li>
                  <li>مواقف سيارات.</li>
                  <li>البنوك (إلا إذا كانت سرقة بنك)</li>
                  <li>متاجر المجوهرات (إلا إذا كانت سرقة)</li>
                  <li>المتاجر (ما لم يكن سرقة متجر)re</li>
                </ul>
                <h3>
                  <strong>موت الشخصية او ما يسمى مور آر بي</strong>
                </h3>
                <p>
                  الموت النهائي للشخصية وبداية شخصية وقصة جديدة ، هذا العمل
                  يصاحب مسح جميع البيانات والحسابات المتعلقة بتلك الشخصية ، على
                  سبيل المثال لا يمكنك استعادة الممتلكات الشخصية كالمال
                  والسيارات .. الخ. قبل القيام بسيناريو الموت النهائي لشخصيتك أو
                  أي شخصية أخرى ، عليك فتح تذكرة وإرسال ملف إلى الإدارة ، ثم
                  ستقرر الإدارة ما إذا كنت ستقبلها أو ترفضها ، يجب أن تكون هناك
                  بعض الأسباب الوجيهة مصحوبة بالأدلة. لم يعد يستخدم مصطلح ابن
                  العم بأي شكل، وكل الشخصيات التي تقوم بإنشائها منفصلة ، وليست
                  منتسبة بأي شكل ، فهم لا يعرفون بعضهم البعض ، فهم ليسوا من
                  أفراد العائلة ، هم يلعبون قصص مختلفة ، امتنع عن استدعاء شخص
                  آخر من خلال حقيقة أنك تعرف أحد شخصياتهم الأخرى ، لا تلمح إلى
                  أنك تعرف واحدًا أو أكثر من شخصياتهم الأخرى ، فهذا يفسد لعب
                  الأدوار والقصة ، تعاملهم كشخص جديد بدلاً من معاملتهم كشخص
                  تعرفه.
                </p>
                <h3>
                  <strong>تفاعلات /OOC, /me و /do:</strong>
                </h3>
                <ul>
                  <li>
                    <p>
                      الرسائل القصيرة والصوت والراديو والهاتف والأوامر مثل me أو
                      do مخصصة لمحتوى IC فقط.
                    </p>
                  </li>
                  <li>
                    <p>
                      <strong>/me</strong> and <strong>/do</strong> are a usage
                      that serves to describe the state of the RP character, an
                      action he performs, a characteristic he has.
                    </p>
                  </li>
                  <li>
                    <p>
                      لا ينبغي استخدامهم للتحدث HRP أو حتى إجراء مناقشة مشابهة
                      لمحادثة نصية (gg, ez...)
                    </p>
                  </li>
                  <li>
                    <p>
                      <strong>OOC </strong>تعني خارج الشخصية. Out-Of-Character
                      هو أي اتصال مطلوب بين اللاعبين. في أي وقت داخل اللعبة ،
                      يجب عليك تجنب الدردشة خارج الشخصية قدر الإمكان ما لم يكن
                      ذلك ضروريًا للعب الأدوار.re
                    </p>
                  </li>
                </ul>
                <h3>
                  <strong>إستخدام القليتشات, الثغرات او الغش</strong>
                </h3>
                <p>
                  يحظر استخدام آليات اللعبة (مقصودة أو غير مقصودة) للحصول على
                  ميزة غير عادلة أو لكسب المال. بصفتك عضوًا في السيرفر، يتعين
                  عليك الإبلاغ عن أي أخطاء أو عيوب في النظام بمجرد العثور عليها.
                  سيؤدي العبث بالخلل أو استغلاله أو استخدامه إلى حظر دائم.re
                </p>
              </section>
              <section>
                <h2>قوانين حسب الحالة</h2>
                <h3>
                  <strong>
                    <span>القواعد الجنائية</span>
                  </strong>
                  ⛓️ <strong>:</strong>
                </h3>
                <ul>
                  <li>
                    اربعة اشخاص من نفس الفريق هو العدد المسموح به كحد اقصى في
                    الاعمال الاجرامية.
                  </li>
                  <li>
                    لا يسمح للاعبين بلعب دور القاتل المتسلسل , لان هذا يشجع على
                    القتل العشوائي بدون سبب واضح.
                  </li>
                  <li>
                    ممنوع ارتكاب الاعمال الاجرامية او غير القانونية في المناطق
                    الامنة التي تكون واضحة للعيان.
                  </li>
                  <li>
                    اذا بدأ سيناريو مع شخص في منطقة غير امنة ثم قام بالهرب الى
                    منطقة امنة , يجب ان يتوقف السيناريو فورا.
                  </li>
                  <li>
                    يجب ان تتوقف كل الانشطة الاجرامية 30 دقيقة قبل اعادة تشغيل
                    السيرفر.
                  </li>
                  <li>
                    لا يمكنك الاعتداء او خطف العاملين في المجال الطبي اثناء
                    تأدية واجبهم.
                  </li>
                  <li>
                    لا يمكنك استعمال السيارة التي توفرها وظيفتك في وظيفة غير
                    قانونية.
                  </li>
                  <li>يجب عليك اخذ استراحة 30 دقيقة بين عمل اجرامي و اخر.</li>
                  <li>بمجرد دخولك السجن , ستفقد وظيفتك تلقائيًا.</li>
                </ul>
                <h3>
                  <strong>
                    <span>سرقة منزل</span>
                  </strong>
                  🏡 <strong>:</strong>
                </h3>
                <ul>
                  <li>اقصى عدد لسرقة منزل هو 3 اشخاص.</li>
                  <li>يجب على كل الأفراد التواجد داخل المنزل.</li>
                  <li>لا يمكن أخذ رهينة الى المنزل.</li>
                  <li>
                    ممنوع قتل الشرطة عند دخولهم مباشرة الى المنزل، يجب اعطائهم
                    فرصة لاخذ مواقعهم( نظرا للشاشة السوداء ) التي تظهر عند
                    الدخول الى المنزل.
                  </li>
                </ul>
                <h3>
                  <strong>
                    <span>سرقة بقالة</span>
                  </strong>
                  🏪 <strong>:</strong>
                </h3>
                <ul>
                  <li>اقصى عدد لسرقة بقالة هو 3 اشخاص.</li>
                  <li>يجب على كل الأفراد التواجد داخل البقالة.</li>
                  <li>مسموح بأخذ رهينة واحدة.</li>
                  <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
                </ul>
                <h3>
                  <strong>
                    <span>سرقة محل مجوهرات</span>
                  </strong>
                  💎 <strong>:</strong>
                </h3>

                <ul>
                  <li>سرقة محل مجوهرات.</li>
                  <li>على كل الافراد التواجد داخل المحل.</li>
                  <li>يمكن أن تأخذ 3 رهائن كحد أقصى.</li>
                  <li>يجب إكمال السرقة الى الآخر عند بدئها.</li>
                  <li>
                    في حالة عدم وجود رهينة يجب أن تبقى على إستعداد للقتال عند
                    وصول الشرطة نظرا لعدم تواجد أي مواطن في خطر.
                  </li>
                  <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
                </ul>
                <h3>
                  <strong>
                    <span>سرقة بنك</span>
                  </strong>
                  💵 <strong>:</strong>
                </h3>

                <ul>
                  <li>
                    Fleeca Bank (بنك صغير) : اقصى عدد لسرقة بنك صغير هو 4 اشخاص.
                    <ul>
                      <li>✔️ مسموح للمواطنين.</li>
                      <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 24 ساعة.</li>
                      <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
                    </ul>
                  </li>
                  <li>
                    Paleto Bank (بنك باليتو) : اقصى عدد لسرقة بنك باليتو هو 5
                    اشخاص.
                    <ul>
                      <li>❌ غير مسموح للمواطنين.</li>
                      <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 24 ساعة.</li>
                      <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
                    </ul>
                  </li>
                </ul>
                <ul>
                  <li>
                    Pacific Bank (بنك مركزي) : اقصى عدد لسرقة بنك المركزي هو 7
                    اشخاص.
                  </li>
                  <ul>
                    <li>❌ غير مسموح للمواطنين.</li>
                    <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 3 أيام.</li>
                    <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
                    <li>⚠️ يمكن أخذ 4 رهائن كحد أقصى.</li>
                  </ul>
                </ul>
                <ul>
                  <li>
                    في حالة عدم وجود رهينة يجب أن تبقى على إستعداد للقتال عند
                    وصول الشرطة نظرا لعدم تواجد أي مواطن في خطر.
                  </li>
                  <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
                </ul>
                <h3>
                  <strong>
                    <span>فئات الأسلحة</span>
                  </strong>
                  🔫 <strong>:</strong>
                </h3>

                <ul>
                  <li>
                    <strong>الفئة 1 :</strong> FN .45 - M9 - 1911 - Pistol -
                    Pistol MK2 - Combat Pistol - Heavy Pistol - SNS-Pistol.
                  </li>
                  <li>
                    <strong>الفئة 2 :</strong> Desert Eagle - Mac-10 - Uzi -
                    Mossberg - Remington - AP-Pistol - Desert Eagle - Vintage
                    Pistol- Marksman Pistol - Revolver - Micro-SMG - Machine
                    Pistol - SMG - SMG MK2 - Assault SMG - Combat PDW - Mini SMG
                    - Pumpshotgun - Sawnoff Shotgun - Autoshotgun.
                  </li>
                  <li>
                    <strong>الفئة 3 :</strong> M4 - Hunting Rifle- AK-47 - AR-15
                    - m70 - Scar-H - Assaultrifle - Assaultrifle MK2 -
                    Advancedrifle - Specialcarbine - Bulluprifle - Compactrifle
                    - Bullupshotgun - Assaultshotgun - Musket - Heavyshotgun.
                  </li>
                  <li>
                    <strong>الأسلحة البيضاء</strong> : Baseball Bat - Battle
                    Hatchet - Knife - Switch Blade - Wrench - Hammer - Machete -
                    Nightstick.
                  </li>
                </ul>
                <h3>
                  <strong>
                    <span>إمكانية إستعمال فئات الأسلحة</span>
                  </strong>
                  🔫 <strong>:</strong>
                </h3>
                <ul>
                  <li>
                    <strong>الفئة 1</strong> حرة في الاستعمال و لكن لأسباب
                    مقنعة.
                    <ul>
                      <li>
                        🏡 سرقة منزل -🏪 سرقة بقالة -💎 سرقة محل مجوهرات -🧑
                        القبض على رهينة -⚔️ القتال في النقاط الممنوعة.
                      </li>
                    </ul>
                  </li>
                </ul>
                <ul>
                  <li>
                    <strong>الفئة 2 و الفئة 3</strong>: تستعمل غالبا من طرف
                    العصابات.
                    <ul>
                      <li>
                        💵 سرقة بنك -💎 سرقة محل مجوهرات - 🧑 القبض على رهينة -
                        ⚔️القتال في النقاط الممنوعة.
                      </li>
                    </ul>
                  </li>
                </ul>
                <ul>
                  <li>
                    <strong>الأسلحة البيضاء</strong> حرة في الاستعمال و لكن يجب
                    عليك التهديد أولا.
                  </li>
                </ul>
                <h3>
                  <strong>
                    <span>الاختطاف و السرقة</span>
                  </strong>
                  💀 <strong>:</strong>
                </h3>
                <ul>
                  <li>يجب أن يتواجد على الأقل 3 من أفراد الشرطة.</li>
                  <li>لا يمكنك سرقة أكثر من 1000$ من اللاعبين.</li>
                  <li>ممنوع إختطاف أي شخص بدون سبب.</li>
                  <li>لا يمكنك إجبار الأشخاص على إستخراج أموالهم من البنك.</li>
                  <li>
                    ممنوع العودة الى المكان الذي إختطفت فيه أحد إذا علمت أنه تم
                    الاتصال بالشرطة.
                  </li>
                  <li>
                    لايمكنك إجبار الرهينة على البقاء لأكثر من 30 دقيقة، هذا محبط
                    و غير عادل.
                  </li>
                  <li>
                    يجب أن يتواجد على الأقل 4 من أفراد الشرطة لخطف شرطي، لا
                    يمكنك أخذ أدوات الشرطة (ما عدى الرصاص و الكلبشات)
                  </li>
                  <li>أخذ شرطي كرهينة مسموح كآخر حل فقط</li>
                </ul>
                <h3>
                  <strong>
                    <span>حمل الموتى</span>
                  </strong>
                  💀 <strong>:</strong>
                </h3>
                <ul>
                  <li>ممنوع تحريك الميت لاخذ ممتلكاته.</li>
                  <li>
                    ممنوع حمل الميت لأخذه للمستشفى في: دراجة نارية، سيارة أقل من
                    4 مقاعد
                  </li>
                </ul>
                <h3>
                  <strong>
                    <span>إستدراج الشرطة</span>
                  </strong>
                  👮 <strong>:</strong>
                </h3>
                <ul>
                  <li>
                    لا يسمح بارتكاب جرائم على مقربة من الشرطة (مخالفة قوانين
                    المرور بشكل علني) بغرض استدراجهم و بدأ مطاردة.
                  </li>
                </ul>
              </section>
              <section>
                <h2>
                  <strong>شروط القبول كستريمر</strong>
                </h2>
                <p>
                  اذا لم تكن لديك شارة الستريمر في سيرفر دِيزاد كرُو , يجب عليك
                  إتباع ما يلي للحصول عليها :
                </p>
                <ol>
                  <li>
                    <span>ان يكون عمرك اكثر من 18 سنة ..</span>
                  </li>
                  <li>
                    ان تكون القناة التي تبث فيها نظيفة , يعني انه لا يوجد في
                    البث اهانات او كلمات عنصرية او قومية او اي محتوى غير لائق.
                  </li>
                  <li>
                    ان لا يكون لديك شارة الستريمر او امتيازات في سيرفر اخر
                  </li>
                  <li>ان لا يكون لديك بثوث قديمة في صفحتك لسيرفر اخر</li>
                  <li>
                    يجب اضافة رابط ديسكور ديزادكرو في سيرتك الذاتية في الصفحة و
                    اثناء البث ايضا
                  </li>
                </ol>
                <h2>
                  <strong>قوانين الستريمرز</strong>
                </h2>
                <ul>
                  <li>
                    <b>
                      <font color="red">
                        بصفتك ستريمر و لديك شارة لا يجب عليك البث او اللعب في
                        سيرفر اخر
                      </font>
                    </b>
                  </li>
                  <li>حصولك على الشارة لا يعطيك اي امتيازات داخل اللعبة</li>
                  <li>
                    بصفتك ستريمر ممنوع عليك الكلام في الدين او السياسة اثناء
                    البث
                  </li>
                  <li>
                    بصفتك ستريمر تحمل الشارة يجب ان يكون البث خال من اي كلام غير
                    لائق
                  </li>
                  <li>
                    بصفتك ستريمر تحمل الشارة ممنوع عليك الكلام حول سيرفر اخر او
                    ستريمر اخر اثناء البث.
                  </li>
                  <li>بصفتك ستريمر تحمل الشارة ممنوع عليك الكلام بصفة سلبية او اعطاء صورة سيئة عن السيرفر اثناء البث</li>
                </ul>
              </section>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default ArabicRules;
