import React from "react"
import styles from "../rules.module.css"

const ServerRulesAr = () => {
  return (
    <section>
      <h2>قوانين السيرفر</h2>
      <p>
        من أجل دخول سيرفر ديزاد كرو للحياة الواقعية يجب ان تتوفر في اللاعب
        الشروط التالية. هذه الشروط نهائية و لا توضع إي إستثناءات من أجل اي احد.
        يوجد بعض اللاعبين القدم الذين تواجدوا في السيرفر قبل هذه الشروط
      </p>
      <h3>شروط الإنظمام إلى السيرفر</h3>
      <ol className={styles.rules}>
        <li>السن الادنى للانضمام للسيرفر هو 18 سنة .</li>
        <li>يجب ان تكون متقن للغة العربية و تفهمها جيدا.</li>
        <li>يجب ان تملك ميكروفون عالي الجودة للتواصل مع اللاعبين.</li>
        <li>
          ممنوع عليك اهانة اللاعبين باي شكل كان , لا تأخذ الروبلاي بشكل شخصي.
        </li>
        <li>ممنوع التحدث في الدين و السياسة .</li>
        <li>
          يجب عليك اختيار اسم واقعي ( اسم و لقب ) لشخصيتك في الروبلاي , ممنوع
          استعمال الارقام في كتابة الاسم.
        </li>
        <li>
          لا يمكنك استعمال الاموال الحقيقة لشراء اغراض داخل اللعبة ( مثل سيارة
          او منزل) لدينا نظام اقتصادي جيد و لا نشجع الدفع مقابل الفوز في اللعبة.
        </li>
        <li>
          اي شيء يحدث لك اثناء تواجدك بعيدا عن الحاسوب اثناء اللعب 'AFK' هو تحت
          مسؤوليتك الخاصة , اذا وجدت شخص في هذه الحالة 'AFK' حاول الابتعاد عنه.
        </li>
        <li>
          تعامل مع طاقم الدعم باحترام , فهم موجودون لضمان ان تكون تجربتك في
          السيرفر جيدة , ممتعة و عادلة , قرارهم نهائي.
        </li>
        <li>
          يجب ان تقدر حياتك دائما عند قيادة السيارة , هذا يعني انه لا يجب عليك
          القيادة بسرعة جنونية في المدينة لانه يعرض حياتك للخطر دون وجود سبب
          وجيه.
        </li>
        <li>
          لا يمكنك ايقاف السيناريو مهما حدث , اذا كان هناك تجاوز للقوانين يجب
          عليك اكمال السيناريو ثم التقدم للادارة و تقديم شكوى.
        </li>
        <li>ممنوع البقاء بدون حركة داخل السيرفر لفترة طويلة</li>
      </ol>
    </section>
  )
}

export default ServerRulesAr
