import React from "react"

const InGameAr = () => {
  return (
    <section>
      <h2>القوانين داخل المدينة</h2>
      <p>
        كل شيء مسموح داخل السيرفر فقط لا تقم بمخالفة قواعد الرول بلاي , و استمر
        في لعب دورك وفقا لقصة شخصيتك و اهدافها يمكنك ايجاد بعض النصائح و القواعد
        في االسفل
      </p>

      <ul>
        <li>
          قصة شخصيتك هي اهم شيء في الروبالي , لذلك يجب ان تكون افعالك , اهدافك
          وتفكيرك منسجما مع خلفية شخصيتك
        </li>
        <li>
          {`لا تخرج عن شخصيتك تحت اي ظرف ( لا تتكلم خارج الرول بلاي , لا تتكلم في مواضيع تجعلك تخرج عن شخصيتك ) `}
        </li>
        <li>{`لا تقم بافعال لـتجبر الآخرين على مخافلة قواعد الرول بلاي `}</li>
        <li>
          {` ممنوع استخدام أو نقل المعلومات التي لم تتحصل عليها شخصيتك داخل اللعبة و
          استعماله`}
        </li>
        <li>{`ممنوع الكلام / اعطاء معلومات  اثناء سقوطك مصاب`}</li>
        <li>{`ممنوع استخدام مركبات العمل لأغراض أخرى`}</li>
        <li>{` البحث عن اسرع الطرق للحصول على المال بدلا من التركيز على الروبلاي`}</li>
        <li>{`ممنوع القيادة بسرعات غير واقعية دون سبب شخصي مرارًا وتكرارًا`}</li>
        <li>{`اذا اصيبت شخصيتك او استيقظت في المستشفى ,فان شخصيتك تنسى كل الاحداث التي سبقت ذلك`}</li>
        <li>{`يجب أن تحاول الاتصال بالمساعدة الطبية عندما تكون عاجزًا`}</li>
        <li>{`عليك بالخوف بشكل واقعي على حياتك عندما تتعرض للتهديد بالأسلحة أو بوسائل أخرى.`}</li>
        <li>{`يمنع إغمار أي مركبة في الماء عمدا`}</li>
        <li>{`لا ينبغي إيقاف الرول بلاي أو أن يصبح أقل جدية قبل الاعصار؛ يجب أن يستمر كالمعتاد.`}</li>
        <li>{`يجب على كل اللاعبين احترام الجهات الحكومية 'الشرطة , الجيش , القضاة .....`}</li>
        <li>
          {`لا تقم بأي جريمة في المناطق الآمنة المذكورة أدناه :`}
          <ul>
            <li>{`مقرالحكومة ومراكزالشرطة`}</li>
            <li>{`المستشفيات والمطارات والموانئ وأماكن العمل`}</li>
            <li>{` مواقف سيارات`}</li>
            <li>{` البنوك (إلا إذا كانت سرقة بنك)`}</li>
            <li>{` متاجر المجوهرات (إلا إذا كانت سرقة)`}</li>
            <li>{` المتاجر (ما لم يكن سرقة متجر)`}</li>
          </ul>
        </li>
      </ul>
      <h3>
        <strong>موت الشخصية او ما يسمى مور آر بي</strong>
      </h3>
      <p>
        الموت النهائي للشخصية وبداية شخصية وقصة جديدة ، هذا العمل يصاحب مسح جميع
        البيانات والحسابات المتعلقة بتلك الشخصية ، على سبيل المثال لا يمكنك
        استعادة الممتلكات الشخصية كالمال والسيارات .. الخ. قبل القيام بسيناريو
        الموت النهائي لشخصيتك أو أي شخصية أخرى ، عليك فتح تذكرة وإرسال ملف إلى
        الإدارة ، ثم ستقرر الإدارة ما إذا كنت ستقبلها أو ترفضها ، يجب أن تكون
        هناك بعض الأسباب الوجيهة مصحوبة بالأدلة. لم يعد يستخدم مصطلح ابن العم
        بأي شكل، وكل الشخصيات التي تقوم بإنشائها منفصلة ، وليست منتسبة بأي شكل ،
        فهم لا يعرفون بعضهم البعض ، فهم ليسوا من أفراد العائلة ، هم يلعبون قصص
        مختلفة ، امتنع عن استدعاء شخص آخر من خلال حقيقة أنك تعرف أحد شخصياتهم
        الأخرى ، لا تلمح إلى أنك تعرف واحدًا أو أكثر من شخصياتهم الأخرى ، فهذا
        يفسد لعب الأدوار والقصة ، تعاملهم كشخص جديد بدلاً من معاملتهم كشخص
        تعرفه.
      </p>
      <h3>
        <strong>إستخدام القليتشات, الثغرات او الغش</strong>
      </h3>
      <p>
        يحظر استخدام آليات اللعبة (مقصودة أو غير مقصودة) للحصول على ميزة غير
        عادلة أو لكسب المال. بصفتك عضوًا في السيرفر، يتعين عليك الإبلاغ عن أي
        أخطاء أو عيوب في النظام بمجرد العثور عليها. سيؤدي العبث بالخلل أو
        استغلاله أو استخدامه إلى حظر دائم.re
      </p>
    </section>
  )
}

export default InGameAr
