import React from "react"
import styles from "../rules.module.css"

const ServerKeywordsAr = () => {
  return (
    <section>
      <h2>الكلمات و المصطلحات</h2>
      <p>
        سيوضح هذا القسم بعض الكلمات والمصطلحات التي قد تصادفك أثناء المشاركة في
        اللعب. يُرجى التأكد من فهمك لهذه الشروط حيث لا يُسمح بأي مما يلي في
        Dz-Crew RP.
      </p>
      <ul className={styles.rules}>
        <h2>كلمات</h2>
        <li>
          <strong>Lags/لاج: </strong>صداع
        </li>
        <li>
          <strong>Microphone/ميكروفون: </strong>الأحبال الصوتية / الحنجرة
        </li>
        <li>
          <strong>Discord/الديسكورد: </strong>راديو
        </li>
        <li>
          <strong>Disconnect/نقفل: </strong>افصل مخي
        </li>
        <li>
          <strong>Ban/بان: </strong>رحلة
        </li>
        <li>
          <strong>Glitch/جليتش: </strong>سحر أسود
        </li>
        <li>
          <strong>Button/زر: </strong>عظلة
        </li>
        <li>
          <strong>Server/السيرفر: </strong>المدينة
        </li>

        <li>
          <strong>Server restart: </strong>إعصار
        </li>
        <li>
          <strong>الآي دي: </strong>CCP
        </li>
        <h2>مصطلحات</h2>
        <li>
          <p>
            <strong>BackStory: </strong> هي قصة شخصيتك وهويته (الاسم ، العمر ..
            إلخ) ، ماضيه وهدفه في المدينة
          </p>
        </li>
        <li>
          <p>
            <strong>Powergaming: </strong>يحظر على شخصيتك فعل أي شيء لا يستطيع
            الإنسان فعله في الحياة الواقعية. إن تمثيل الأدوار الذي لا يمنح
            اللاعبين الآخرين الفرصة للتصرف بحرية بشأن أفعالهم مخالف للقانون
          </p>
        </li>

        <li>
          <p>
            <strong>FailRP: </strong>مصطلح واسع ولكنه يحدث بشكل عام عندما يفعل
            اللاعب شيئًا لا يعتبره معظم اللاعبين حقيقي.
          </p>
        </li>

        <li>
          <p>
            <strong>Meta Gaming: </strong>يجب أن تفرق بينك وبين الشخصية التي
            تلعبها في اللعبة ، يمنع استخدام أي معلومات لم تحصل عليها شخصيتك من
            لعب الأدوار، مما قد يتسبب في تغيير نتائج سيناريوهات لعب الأدوار
            الحالية أو المستقبلية.
          </p>
        </li>

        <li>
          <p>
            <strong>Stream Sniping: </strong>التواجد في ستريم أثناء وجودك على
            السيرفر يستخدم كدليل ضدك إذا تم تقديم شكوى.
          </p>
        </li>

        <li>
          <p>
            <strong>Mass Roleplay: </strong>يتجاوز عدد سكان مدينة دزكرو 7 ملايين
            نسمة ، وبالتالي هناك عدد كبير من المواطنين من حولك ، خاصة في الأماكن
            العامة سواء كانوا على الأقدام أو مسافرين ، لذلك لا تعتقد أنك وحدك
            ولا أحد يراقبك.
          </p>
        </li>

        <li>
          <p>
            <strong>FearRP: </strong> يجب أن تظهر الخوف عندما تكون شخصيتك في
            خطر.
          </p>
        </li>

        <li>
          <p>
            <strong>Value of Life: </strong>يجب أن تقدر حياتك وحريتك ، وكذلك
            حياة الآخرين ، على سبيل المثال، لا يُسمح لك بإخراج بندقيتك مع شخص
            يوجه بنادقه إليك. إذا كانت حياة شخصيتك في خطر مباشر، فيجب أن تخشى
            وتطيع الأوامر المعطاة لك
          </p>
        </li>

        <li>
          <p>
            <strong>Random Death Matching: </strong>يحظر قتل أو خطف أو حتى سجن
            الأشخاص دون سبب قاهر أو أن يسبقه نزاع لفظي.
          </p>
        </li>

        <li>
          <p>
            <strong>Vehicle Death Matching: </strong>يحظر استخدام المركبات لقتل
            اللاعبين.
          </p>
        </li>

        <li>
          <p>
            <strong>Combat Logout: </strong>ممنوع الخروج من اللعبة أثناء وجودك
            في صراع أو إذا لم ينته السيناريو الذي تشارك فيه
          </p>
        </li>

        <li>
          <p>
            <strong>No Scripts stories: </strong> لا يُسمح للاعبين برواية
            الأحداث وفرضها لأن محاولة التحكم في السيناريو تتعارض مع قواعد
            السيرفر، والهدف من لعب الأدوار هو المشاركة في سيناريوهات تعاونية بين
            الأشخاص ، دون فرض أي نتيجة على اللاعبين. أو خاصة الضحايا.
          </p>
        </li>

        <li>
          <p>
            <strong>New Life rules: </strong>عندما تخلق من جديد ، يجب أن تنسى
            الأحداث التي أدت إلى موتك.
          </p>
        </li>

        <li>
          <p>
            <strong>Vehicle Drive-bys: </strong>لا يُسمح بإطلاق النار من مركبة
            إلا في حالة وجود سبب مقنع، يُسمح للسائق بإطلاق النار ، ويُسمح فقط
            لشخص واحد (1) بإطلاق النار.
          </p>
        </li>

        <li>
          <p>
            <strong>Lootboxing: </strong> يحظر نهب أي لاعب دون سبب واضح . يحظر
            نهب لاعب تجده على الأرض بسبب حادث سيارة. يحظر النهب إذا لم تشارك أنت
            أو مجموعتك في السيناريو. يحظر النهب المتكرر بغرض سرقة الممتلكات
          </p>
        </li>

        <li>
          <p>
            <strong>Role-playing before the bloodshed: </strong>
            يجب أن يبدأ كل نزاع لفظيًا أو مسبوقًا بأحداث أو قصة متعلقة بذلك
            الهجوم ، ويجب أن يكون الضحية في هذا النزاع قادرًا على فهم أن حياته
            في خطر ، ولأي سبب ، ومن يهاجمه ، قبل أن يتضرر.
          </p>
        </li>

        <li>
          <p>
            <strong>Non-Roleplay: </strong>تعتبر الإجراءات غير الواقعية أو التي
            تروّج لأداء أدوار رديء الجودة بمثابة أسلوب غير لعب الأدوار. يتعين
            على اللاعبين لعب دور الشخصية في جميع الأوقات. يمكن للمشرفين إيقاف
            لعب الأدوار مؤقتًا أو إلغاؤه فقط. يجب على اللاعبين عدم الدخول في
            مواقف التي ليس لديهم وقت للعبها. إذا تمت مطاردة أحد اللاعبين ، فيجب
            عليه الانتظار لمدة 15 دقيقة قبل أن يتمكن من تسجيل الخروج من اللعبة..
          </p>
        </li>
      </ul>
    </section>
  )
}

export default ServerKeywordsAr
