import React from "react"

const StreamingRulesAr = () => {
  return (
    <section>
      <h2>
        <strong>شروط القبول كستريمر</strong>
      </h2>
      <p>
        اذا لم تكن لديك شارة الستريمر في سيرفر دِيزاد كرُو , يجب عليك إتباع ما
        يلي للحصول عليها :
      </p>
      <ol>
        <li>
          <span>ان يكون عمرك اكثر من 18 سنة ..</span>
        </li>
        <li>
          ان تكون القناة التي تبث فيها نظيفة , يعني انه لا يوجد في البث اهانات
          او كلمات عنصرية او قومية او اي محتوى غير لائق.
        </li>
        <li>ان لا يكون لديك شارة الستريمر او امتيازات في سيرفر اخر</li>
        <li>ان لا يكون لديك بثوث قديمة في صفحتك لسيرفر اخر</li>
        <li>
          يجب اضافة رابط ديسكور ديزادكرو في سيرتك الذاتية في الصفحة و اثناء البث
          ايضا
        </li>
      </ol>
      <h2>
        <strong>قوانين الستريمرز</strong>
      </h2>
      <ul>
        <li>
          <b>
            <font color="red">
              بصفتك ستريمر و لديك شارة لا يجب عليك البث او اللعب في سيرفر اخر
            </font>
          </b>
        </li>
        <li>حصولك على الشارة لا يعطيك اي امتيازات داخل اللعبة</li>
        <li>بصفتك ستريمر ممنوع عليك الكلام في الدين او السياسة اثناء البث</li>
        <li>
          بصفتك ستريمر تحمل الشارة يجب ان يكون البث خال من اي كلام غير لائق
        </li>
        <li>
          بصفتك ستريمر تحمل الشارة ممنوع عليك الكلام حول سيرفر اخر او ستريمر اخر
          اثناء البث.
        </li>
        <li>
          بصفتك ستريمر تحمل الشارة ممنوع عليك الكلام بصفة سلبية او اعطاء صورة
          سيئة عن السيرفر اثناء البث
        </li>
      </ul>
    </section>
  )
}

export default StreamingRulesAr
