import React from "react"

const CriminalRulesAr = () => {
  return (
    <section>
      <h2>القوانين الاجرامية</h2>
      <h2>Criminal Rules</h2>
      <h3>
        <strong>
          <span>قوانين الاجرام</span>
        </strong>
        ⛓️ <strong>:</strong>
      </h3>
      <p>
        {` كل شيء مسموح به  فقط لا تكسر قواعد الروبلاي `}
        <strong>{` وكن حذرًا مع (FAIRPLAY)
             FEARRP ، METAGAMING)  `}</strong>
        {`, فيما يلي بعض القواعد التفصيلية لذلك`}
        <br />
        <span style={{ color: "red" }}>
          {" "}
          <strong>
            {` أي إساءة استخدام للقواعد الجنائية دون الكثير من الروبلاي وعدم التوافق مع
              خلفية شخصيتك ، يتمتع المشرفون بالحق في الحكم عليك`}
          </strong>
        </span>
      </p>
      <ol>
        <li>
          {`يقتصر عدد الأشخاص في سيناريو واحد على 8 أشخاص كحد أقصى من نفس الفريق في الجريمة الأفعال `}
          <span color="red">{`(  و 5 للمواطنين )`}</span>
        </li>

        <li>
          <strong>{`النهب / الاختطاف / القتل`}</strong>:
          <ul>
            <li>
              <strong>السرقة </strong>: سمح للجميع بالسرقة خارج المنطقة الآمنة
              (في المدينة تحتاج الى السبب) (إذا كان المواطن عاملا في البلدية ،
              فحاول تجنب سرقته (على سبيل المثال: أخذ سلعته لبيعها ) (الاكثار
              منها ممنوع)
            </li>
            <li>
              <strong>الاختطاف </strong>:{" خارج المنطقة الآمنة  "}
              <ul>
                <li>الخطف مسموح للجميع لكن يحتاج الى سبب</li>
                <li>
                  <strong>بين العصابات </strong>: لا داعي ليكون هنالك سبب ما
                  (هذا القانون لا يشمل اختطاف المواطن العادي)(يمكن لعصابة أن
                  تضفي على عضو عصابة آخر دون سبب)
                </li>
              </ul>
            </li>
            <li>
              <strong>القتل </strong>: لا يمكن لأحد أن يقتل بدون سبب ، القتل في
              المنطقة الامنة يؤدي الى الحظر. (حتى بعد النهب أو الاختطاف فهذا ليس
              سببًا جيدًا ، حتى إذا رأى وجهك)
            </li>
          </ul>
        </li>
        <li>يجب ألا يكون هناك أي أنشطة غير قانونية قبل 30 دقيقة من الاعصار</li>
        <li>يجب أن يكون هناك 3 رجال شرطة على الأقل لاختطاف مواطن.</li>
        <li>لا يمكنك سرقة أكثر من 5000 دولار .</li>
        <li>
          لا يمكنك اصطحاب شخص ما إلى أحد البنوك / ماكينة الصراف الآلي لسحب
          الأموال.
        </li>
        <li>
          ممنوع العودة إلى المكان الذي اختطفت فيه بالفعل شخصًا مع علمك بوجود
          اتصلوا بالشرطة
        </li>
        <li>
          لا يمكنك احتجاز رهينة لمدة تزيد عن 30 دقيقة ، فهذا أمر محبط وغير عادل.
        </li>
        <li>
          -يجب أن يكون هناك ما لا يقل عن 4 رجال شرطة على الاقل لاختطاف ضابط شرطة
          ، ولا يُسمح لك بنهب أغراضهم (ضع الأصفاد جانبا و الذخيرة)
        </li>
        <li>لا يُسمح بأخذ ضابط الشرطة كرهينة إلا كملاذ أخير.</li>
        <li>
          لا يسمح بارتكاب جرائم على مقربة من الشرطة (مخالفة قوانين المرور بشكل
          علني) بغرض استدراجهم و بدأ مطاردة.
        </li>
        <li>
          لا يمكنك استعمال السيارة التي توفرها وظيفتك في وظيفة غير قانونية.
        </li>
        <li>
          لا يمكنك الاعتداء او خطف العاملين في المجال الطبي اثناء تأدية واجبهم.
        </li>
        <li>
          إذا انضمت الشرطة كطرف ثالث إلى سيناريو فيه اطلاق النار وأنت تقوم
          بالنهب ، يجب أن تهرب إذا قبضوا عليك فهذه مشكلتك.
        </li>
        <li>تحتاج الى الانتظار 30 دقيقة بين عمل اجرامي و اخر </li>
      </ol>
      <h3>
        <strong>
          <span>GANG RULES</span>
        </strong>
        🏡 <strong>:</strong>
      </h3>
      <ul>
        <li>الحد الأقصى لأعضاء العصابة هو 13 (مع وجود خلفية تربطهم )</li>
        <li>
          ممنوع التحالف بين العصابات لاي سبب كان
          <strong>
            ( او مع مواطن لم ينضم للعصابة بعد او تملك شخصيته قصة لا تناسب
            العصابة)
          </strong>
        </li>
        <li>
          يمكنك استعمال الأسلحة البيضاء داخل حي العصابة , و يمكنك الدفاع اثناء
          هجوم عصابة اخرى بالمسدسات و الاسلحة الثقيلة
        </li>
        <li>
          مهاجمة مواطن عادي دون وجود سبب حقيقي يأدي الى الخظر و ربما تحذير
          العصابة و غلقها كليا
          <strong>
            ( ضد الشرطة او عصابة اخرى انت حر في الهجوم المهم انك خارج المنطقة
            الامنة )
          </strong>
          من الافضل لعب سيناريو جيد ثم التفكير في اطلاق النار و النهب
        </li>
      </ul>
      <h3>
        <strong>
          <span>سرقة منزل</span>
        </strong>
        🏡 <strong>:</strong>
      </h3>
      <ul>
        <li>اقصى عدد لسرقة منزل هو 3 اشخاص.</li>
        <li>يجب على كل الأفراد التواجد داخل المنزل.</li>
        <li>لا يمكن أخذ رهينة الى المنزل.</li>
        <li>
          ممنوع قتل الشرطة عند دخولهم مباشرة الى المنزل، يجب اعطائهم فرصة لاخذ
          مواقعهم( نظرا للشاشة السوداء ) التي تظهر عند الدخول الى المنزل.
        </li>
      </ul>
      <h3>
        <strong>
          <span>سرقة بقالة</span>
        </strong>
        🏪 <strong>:</strong>
      </h3>
      <ul>
        <li>اقصى عدد لسرقة بقالة هو 3 اشخاص.</li>
        <li>يجب على كل الأفراد التواجد داخل البقالة.</li>
        <li>مسموح بأخذ رهينة واحدة.</li>
        <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
      </ul>
      <h3>
        <strong>
          <span>سرقة محل مجوهرات</span>
        </strong>
        💎 <strong>:</strong>
      </h3>

      <ul>
        <li>سرقة محل مجوهرات.</li>
        <li>على كل الافراد التواجد داخل المحل.</li>
        <li>يمكن أن تأخذ 3 رهائن كحد أقصى.</li>
        <li>يجب إكمال السرقة الى الآخر عند بدئها.</li>
        <li>
          في حالة عدم وجود رهينة يجب أن تبقى على إستعداد للقتال عند وصول الشرطة
          نظرا لعدم تواجد أي مواطن في خطر.
        </li>
        <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
      </ul>
      <h3>
        <strong>
          <span>سرقة بنك</span>
        </strong>
        💵 <strong>:</strong>
      </h3>

      <ul>
        <li>
          Fleeca Bank (بنك صغير) : اقصى عدد لسرقة بنك صغير هو 4 اشخاص.
          <ul>
            <li>✔️ مسموح للمواطنين.</li>
            <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 24 ساعة.</li>
            <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
          </ul>
        </li>
        <li>
          Paleto Bank (بنك باليتو) : اقصى عدد لسرقة بنك باليتو هو 5 اشخاص.
          <ul>
            <li>❌ غير مسموح للمواطنين.</li>
            <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 24 ساعة.</li>
            <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
          </ul>
        </li>
      </ul>
      <ul>
        <li>
          Pacific Bank (بنك مركزي) : اقصى عدد لسرقة بنك المركزي هو 7 اشخاص.
        </li>
        <ul>
          <li>❌ غير مسموح للمواطنين.</li>
          <li>⚠️ يمكن سرقة البنك مرة واحدة خلال 3 أيام.</li>
          <li>⚠️ على كل الافراد التواجد داخل البنك.</li>
          <li>⚠️ يمكن أخذ 4 رهائن كحد أقصى.</li>
        </ul>
      </ul>
      <ul>
        <li>
          في حالة عدم وجود رهينة يجب أن تبقى على إستعداد للقتال عند وصول الشرطة
          نظرا لعدم تواجد أي مواطن في خطر.
        </li>
        <li>لا يمكن أن تكون الرهينة من أصدقائك مهما كانت الاحوال.</li>
      </ul>
      <h3>
        <strong>
          <span>فئات الأسلحة</span>
        </strong>
        🔫 <strong>:</strong>
      </h3>

      <ul>
        <li>
          <strong>الفئة 1 :</strong> FN .45 - M9 - 1911 - Pistol - Pistol MK2 -
          Combat Pistol - Heavy Pistol - SNS-Pistol.
        </li>
        <li>
          <strong>الفئة 2 :</strong> Desert Eagle - Mac-10 - Uzi - Mossberg -
          Remington - AP-Pistol - Desert Eagle - Vintage Pistol- Marksman Pistol
          - Revolver - Micro-SMG - Machine Pistol - SMG - SMG MK2 - Assault SMG
          - Combat PDW - Mini SMG - Pumpshotgun - Sawnoff Shotgun - Autoshotgun.
        </li>
        <li>
          <strong>الفئة 3 :</strong> M4 - Hunting Rifle- AK-47 - AR-15 - m70 -
          Scar-H - Assaultrifle - Assaultrifle MK2 - Advancedrifle -
          Specialcarbine - Bulluprifle - Compactrifle - Bullupshotgun -
          Assaultshotgun - Musket - Heavyshotgun.
        </li>
        <li>
          <strong>الأسلحة البيضاء</strong> : Baseball Bat - Battle Hatchet -
          Knife - Switch Blade - Wrench - Hammer - Machete - Nightstick.
        </li>
      </ul>
      <h3>
        <strong>
          <span>إمكانية إستعمال فئات الأسلحة</span>
        </strong>
        🔫 <strong>:</strong>
      </h3>
      <ul>
        <li>
          <strong>الفئة 1</strong> حرة في الاستعمال و لكن لأسباب مقنعة.
          <ul>
            <li>
              🏡 سرقة منزل -🏪 سرقة بقالة -💎 سرقة محل مجوهرات -🧑 القبض على
              رهينة -⚔️ القتال في النقاط الممنوعة.
            </li>
          </ul>
        </li>
      </ul>
      <ul>
        <li>
          <strong>الفئة 2 و الفئة 3</strong>: تستعمل غالبا من طرف العصابات.
          <ul>
            <li>
              💵 سرقة بنك -💎 سرقة محل مجوهرات - 🧑 القبض على رهينة - ⚔️القتال
              في النقاط الممنوعة.
            </li>
          </ul>
        </li>
      </ul>
      <ul>
        <li>
          <strong>الأسلحة البيضاء</strong> حرة في الاستعمال و لكن يجب عليك
          التهديد أولا.
        </li>
      </ul>
      <h3>
        <strong>
          <span>الاختطاف و السرقة</span>
        </strong>
        💀 <strong>:</strong>
      </h3>
      <ul>
        <li>يجب أن يتواجد على الأقل 3 من أفراد الشرطة.</li>
        <li>لا يمكنك سرقة أكثر من 1000$ من اللاعبين.</li>
        <li>ممنوع إختطاف أي شخص بدون سبب.</li>
        <li>لا يمكنك إجبار الأشخاص على إستخراج أموالهم من البنك.</li>
        <li>
          ممنوع العودة الى المكان الذي إختطفت فيه أحد إذا علمت أنه تم الاتصال
          بالشرطة.
        </li>
        <li>
          لايمكنك إجبار الرهينة على البقاء لأكثر من 30 دقيقة، هذا محبط و غير
          عادل.
        </li>
        <li>
          يجب أن يتواجد على الأقل 4 من أفراد الشرطة لخطف شرطي، لا يمكنك أخذ
          أدوات الشرطة (ما عدى الرصاص و الكلبشات)
        </li>
        <li>أخذ شرطي كرهينة مسموح كآخر حل فقط</li>
      </ul>
      <h3>
        <strong>
          <span>حمل الموتى</span>
        </strong>
        💀 <strong>:</strong>
      </h3>
      <ul>
        <li>ممنوع تحريك الميت لاخذ ممتلكاته.</li>
        <li>
          ممنوع حمل الميت لأخذه للمستشفى في: دراجة نارية، سيارة أقل من 4 مقاعد
        </li>
      </ul>
      <h3>
        <strong>
          <span>إستدراج الشرطة</span>
        </strong>
        👮 <strong>:</strong>
      </h3>
      <ul>
        <li>
          لا يسمح بارتكاب جرائم على مقربة من الشرطة (مخالفة قوانين المرور بشكل
          علني) بغرض استدراجهم و بدأ مطاردة.
        </li>
      </ul>
    </section>
  )
}

export default CriminalRulesAr
